# EnergyAnalysisBuildingOperatingSchedule Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..EnergyAnalysisBuildingOperatingSchedule Property
ParameterTypeId Class See Also
---
"Building Operating Schedule"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId EnergyAnalysisBuildingOperatingSchedule { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EnergyAnalysisBuildingOperatingSchedule As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EnergyAnalysisBuildingOperatingSchedule {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace